---
kind: method
id: M:Autodesk.Revit.DB.ColorFillSchemeEntry.GetDoubleValue
source: html/ee9f6751-d6bd-cd7a-5a51-1cdf9abdb90b.htm
---
# Autodesk.Revit.DB.ColorFillSchemeEntry.GetDoubleValue Method

Gets the Double value stored within the entry.

## Syntax (C#)
```csharp
public double GetDoubleValue()
```

## Returns
The Double value contained in the entry.

## Remarks
This method should only be used if the StorageType property reports the type of the entry as a Double.